clc,clear 
r=[1.000 0.577 0.509 0.387 0.462 
   0.577 1.000 0.599 0.389 0.322 
   0.509 0.599 1.000 0.436 0.426 
   0.387 0.389 0.436 1.000 0.523 
   0.462 0.322 0.426 0.523 1.000]; 
%下面利用相关系数矩阵求主成分解，val的列为r的特征向量，即主成分的系数 
[vec,val,con]=pcacov(r);%val为r的特征值，con为各个主成分的贡献率 
f1=repmat(sign(sum(vec)),size(vec,1),1); %构造与vec同维数的元素为±1的矩阵 
vec=vec.*f1; %修改特征向量的正负号，每个特征向量乘以所有分量和的符号函数值 
f2=repmat(sqrt(val)',size(vec,1),1); 
a=vec.*f2    %构造全部因子的载荷矩阵，见（40）式  
a1=a(:,1)   %提出一个因子的载荷矩阵 
tcha1=diag(r-a1*a1')   %计算一个因子的特殊方差 
a2=a(:,[1,2])  %提出两个因子的载荷矩阵 
tcha2=diag(r-a2*a2')  %计算两个因子的特殊方差 
ccha2=r-a2*a2'-diag(tcha2)  %求两个因子时的残差矩阵 
gong=cumsum(con)     %求累积贡献率 